set_property PACKAGE_PIN H4 [get_ports {w[3]}]
set_property PACKAGE_PIN J3 [get_ports {w[2]}]
set_property PACKAGE_PIN J2 [get_ports {w[1]}]
set_property PACKAGE_PIN K2 [get_ports {w[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {w[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {w[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {w[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {w[0]}]
set_property PACKAGE_PIN P17 [get_ports clk]
set_property PACKAGE_PIN R15 [get_ports rst]
set_property IOSTANDARD LVCMOS33 [get_ports clk]
set_property IOSTANDARD LVCMOS33 [get_ports rst]
create_clock -period 10.000 -name clk_pin -waveform {0.000 5.000} [get_ports clk]
set_input_delay -clock [get_clocks *] 0.000 [get_ports clk]
set_output_delay -clock [get_clocks *] 0.000 [get_ports -filter { NAME =~  "*" && DIRECTION == "OUT" }]
